; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	spectrograph1 - mode
	thermograph3 - mode
	spectrograph0 - mode
	spectrograph2 - mode
	Star1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Star2 - direction
	Star5 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph3)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph0)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star2)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star13)
)
(:goal (and
	(pointing satellite0 Phenomenon10)
	(pointing satellite1 Star5)
	(have_image Star5 spectrograph1)
	(have_image Star6 spectrograph2)
	(have_image Planet7 thermograph3)
	(have_image Star8 spectrograph2)
	(have_image Planet9 thermograph3)
	(have_image Phenomenon10 spectrograph0)
	(have_image Planet11 spectrograph0)
	(have_image Planet12 spectrograph2)
	(have_image Star13 spectrograph2)
	(have_image Star14 spectrograph2)
))

)

; plan
1. (turn_to satellite1 groundstation0 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 12
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 12
3. (calibrate satellite1 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 12
4. (turn_to satellite1 planet7 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet7)
   goals met: 0 of 12
5. (take_image satellite1 planet7 instrument1 thermograph3)
   added: (have_image planet7 thermograph3)
   goals met: 1 of 12
6. (turn_to satellite1 planet11 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet11)
   goals met: 1 of 12
7. (take_image satellite1 planet11 instrument1 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 2 of 12
8. (turn_to satellite1 phenomenon10 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 12
9. (turn_to satellite0 star2 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star2)
   goals met: 2 of 12
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 12
11. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 2 of 12
12. (take_image satellite1 phenomenon10 instrument1 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 3 of 12
13. (turn_to satellite0 planet12 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet12)
   goals met: 3 of 12
14. (take_image satellite0 planet12 instrument0 spectrograph2)
   added: (have_image planet12 spectrograph2)
   goals met: 4 of 12
15. (turn_to satellite0 planet9 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet9)
   goals met: 4 of 12
16. (take_image satellite0 planet9 instrument0 thermograph3)
   added: (have_image planet9 thermograph3)
   goals met: 5 of 12
17. (turn_to satellite0 star13 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star13)
   goals met: 5 of 12
18. (take_image satellite0 star13 instrument0 spectrograph2)
   added: (have_image star13 spectrograph2)
   goals met: 6 of 12
19. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 6 of 12
20. (take_image satellite0 star14 instrument0 spectrograph2)
   added: (have_image star14 spectrograph2)
   goals met: 7 of 12
21. (turn_to satellite0 star6 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star6)
   goals met: 7 of 12
22. (take_image satellite0 star6 instrument0 spectrograph2)
   added: (have_image star6 spectrograph2)
   goals met: 8 of 12
23. (turn_to satellite0 star8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star8)
   goals met: 8 of 12
24. (take_image satellite0 star8 instrument0 spectrograph2)
   added: (have_image star8 spectrograph2)
   goals met: 9 of 12
25. (turn_to satellite0 phenomenon10 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon10)
   goals met: 10 of 12
26. (turn_to satellite1 star5 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star5)
   goals met: 11 of 12
27. (take_image satellite1 star5 instrument1 spectrograph1)
   added: (have_image star5 spectrograph1)
   goals met: 12 of 12
